{
  "users": [
    {
      "email": "datntph15649@fpt.edu.vn",
      "password": "$2a$10$C6auIyygIOyVn1r7HDs10OOVpUoanR4oCtNINfFGmhX5/PCuP/Ouq",
      "id": 1
    },
    {
      "email": "loannt43@fpt.edu.vn",
      "password": "$2a$10$lCNuPQKN/.u7bZ8vZ02K2OxQfbgwyaSK75BLlLOzNWn0y1h.1s.ZK",
      "role": 0,
      "id": 2
    }
  ],
  "products": [
    {
      "id": 1,
      "name": "iphone 16 promax xanh  nhẹ",
      "price": 27000000,
      "sale": 6500000,
      "image": "https://cdn.tgdd.vn/Products/Images/42/250258/iphone-13-blue-1-600x600.jpg",
      "categoryId": 1,
      "outstanding": "[HOT] Thu cũ lên đời giá cao - Thủ tục nhanh - Trợ giá lên tới 1.000.000đ",
      "descriptionLong": "iPhone 13 Pro Max chắc chắn sẽ là chiếc smartphone cao cấp được quan tâm nhiều nhất trong năm 2021. Dòng iPhone 13 series được ra mắt vào ngày 14 tháng 9 năm 2021 tại sự kiện \"California Streaming\" diễn ra trực tuyến tương tự năm ngoái cùng với 3 phiên bản khác là iPhone 13, 13 mini và 13 Pro. Vậy điện thoại 13 Pro Max giá bao nhiêu? Có gì nổi bật? Cùng tìm hiểu ngay nhé!\n\nĐánh giá iPhone 13 Pro Max – Hiệu năng vô đối, camera cực đỉnh\niPhone 12 ra mắt cách đây chưa lâu, thì những tin đồn mới nhất về iPhone 13 Pro Max đã khiến bao tín đồ công nghệ ngóng chờ. Cụm camera được nâng cấp, màu sắc mới, đặc biệt là màn hình 120Hz với phần notch được làm nhỏ gọn hơn chính là những điểm làm cho thu hút mọi sự chú ý trong năm nay.\n\nThiết kế cạnh phẳng sang trọng, nhiều màu sắc nổi bật\nDòng iPhone 12 được Apple áp dụng ngôn ngữ thiết kế tương tự iPhone 12 năm ngoái với phần cạnh viền máy được dát phẳng sang trọng cùng bốn góc được làm bo cong nhẹ, đây có thể được xem là một thiết kế hoài cổ từ dòng iPhone 5 trước đó. Vì thế mà iPhone 13 Pro Max nói riêng, cũng như dòng iPhone 13 nói chung, cũng sẽ đi theo ngôn ngữ thiết kế này.\n\nĐiểm thay đổi lớn trên 13 Pro Max có thể là phần nhô của cụm camera. Trong khi đó mặt trước của thiết bị được phủ một lớp Ceramic Shield, loại vật liệu cứng hơn bất kỳ loại kính điện thoại thông minh nào hiện có trên thị trường, giúp bảo vệ màn hình iPhone hiệu quả.\n\nThiết kế cạnh phẳng sang trọng, nhiều màu sắc nổi bật\n\nXét về chất liệu, iPhone 13 Pro Max vẫn áp dụng chất liệu thép không gỉ như thế hệ trước đó. Mặt này cũng được phủ một lớp kính mờ giúp hạn chế bám bụi bẩn và vân tay. Ngoài ra, điện thoại cũng sẽ đảm bảo được khả năng chống bụi / nước chuẩn IP68.\n\nVề màu sắc, chiếc iPhone 13 phiên bản Pro Max sẽ được ra mắt với nhiều tùy chọn màu sắc khác nhau. Trong đó gồm một số màu nổi bật như: vàng, bạc, xanh, đen,...\n\nMàn hình với tai nhỏ nhỏ hơn, tốc độ làm tươi 120 Hz\nMột trong những yếu tố khiến iPhone 13 Pro Max đáng mong chờ đó là thiết kế notch \"tai thỏ\" được thu gọn lại. Ngoài kích cỡ màn hình 6.7 inch với tấm nền Super Retina XDR OLED, máy sẽ có thiết kế notch được thu hẹp lại, giúp tăng tỷ lệ hiển thị trên màn hình điện thoại. Tất nhiên, những cảm biến quan trọng như TrueDepth, Face ID hoặc camera selfie đều sẽ giữ nguyên vị trí.\n\nMàn hình notch thu nhỏ với tốc độ làm tươi 120 Hz\n\nRất nhiều nguồn tin cho biết iPhone 13 Pro Max sẽ tăng cường trải nghiệm hình ảnh lên rất nhiều thông qua ProMotion - tích năng giúp đẩy tốc độ làm tươi màn ảnh lên 120 Hz. Đây cũng là chiếc iPhone đầu tiên có tốc độ làm tươi cao lên đến 120Hz, giúp hình ảnh chuyển động mượt mà hơn.\n\nNgoài ra, những tính năng bổ trợ khác như Dolby Vision, True-tone hoặc gam màu rộng chuẩn HDR10 vẫn sẽ được tích hợp vào iP 13 Pro Max.  \n\nCamera nâng cấp, chụp ảnh chất lượng, quay phim chuyên nghiệp\nNhư mọi chiếc iPhone mới khác, camera luôn là yếu tố được người dùng quan tâm nhất, và 13 Pro Max sẽ không làm người dùng thất vọng. Giống với ngôn ngữ thiết kế cho thân máy, ngôn ngữ thiết kế cho camera thường không xảy ra trong thời gian ngắn. Đó là lý do chiếc điện thoại này vẫn sẽ có bộ camera 3 ống kính xếp xen kẽ thành một cụm vuông, đặt ở góc trên bên trái của lưng máy.  \n\nThay đổi lớn về camera đầu tiên nằm ở cảm biến. Máy được trang bị camera góc siêu rộng cải tiến lớn với ống kính khẩu độ f/1.8 và len 6P. Camera siêu rộng hiện tại trên iPhone 12 Pro Max đang ở khẩu độ f/2.4 và len 5P, nên nâng cấp trên sẽ cải thiện ảnh chụp thiếu sáng rất nhiều.\n\nCảm biến LiDAR vẫn sẽ hiện diện trên iPhone 13 Pro Max. Tuy nhiên Apple dự kiến mang cảm biến này lên cả gia đình iPhone 13 và không dành riêng chỉ cho các máy Pro. Điều này được cho là nhằm mang đến trải nghiệm thực tế tăng cường (AR) tốt nhất cho tất cả người dùng.\n\nCamera nâng cấp đáng kể về cảm biến lẫn tính năng chụp ảnh\n\nCamera selfie không thay đổi so với model tiền nhiệm. Có thể iPhone 13 Pro Max sẽ chụp ảnh selfie góc rộng hơn một chút, nhưng còn lại phần lớn ở camera selfie đều giữ nguyên như trước. Và những tính năng như selfie slow-mo, memoji và animoji cũng sẽ hiện diện như nhiều tin đồn cho biết.\n\nVi xử lý nâng cấp, dung lượng pin cải thiện\nGiống với nhiều thế hệ iPhone mới, vi xử lý dự đoán sẽ được nâng cấp lên một bậc với hiệu năng cải thiện đáng kể cùng khả năng hỗ trợ mạng 5G. Trong trường hợp này, iPhone 13 Pro Max sẽ mang trong mình chip Apple A15 Bionic với nhiều nâng cấp khác nhau, cả về hiệu năng xử lý lẫn kết nối internet tốc độ cao.\n\nTheo nhà sản xuất công bố, chip A15 thế hệ mới này cho hiệu năng đồ họa nhanh hơn tới 50% so với các thiết bị smartphone khác. Ngoài ra, khả năng kết nối 5G cũng được cải thiện đáng kể, cùng với đó là chế độ dữ liệu thông minh, giảm tốc độ khi không cần thiết để tiết kiệm điện năng.\n\nVi xử lý nâng cấp hiệu năng, loại bỏ hoàn toàn cổng kết nối\n\niPhone 13 Pro Max cũng được trang bị viên pin dung lượng lớn hơn, cho thời gian sử dụng tăng lên khoảng 2,5 giờ so với thế hệ trước đó. Máy cũng sẽ được trang bị công nghệ sạc nhanh và sạc nhanh không dây.\n\nNếu nhu cầu sử dụng của bạn không quá cao, muốn sở hữu một chiếc iPhone thế hệ mới nhưng không muốn bỏ ra quá nhiều tiền thì có thể tham khảo thêm iPhone 13 128GB chính hãng VN/A đang được giảm giá hấp dẫn tại CellphoneS.\n\nviên pin dung lượng lớn\n\nĐiện thoại iPhone 13 Pro Max giá bao nhiêu?\nVới giá bán dao động từ 35 triệu ~ 50 triệu VNĐ (tùy theo RAM và bộ nhớ trong), Khách hàng có thể mua iPhone 13 Pro Max chính hãng VN/A tại CellphoneS để nhận ngay mức giá tốt nhất cùng nhiều ưu đãi hấp dẫn qua tổng đài tư vấn 1800.2097.\n\nDưới đây là mức giá tương ứng cho từng phiên bản bộ nhớ, các bạn có thể tham khảo:\n\n- Phiên bản 128GB: Khoảng 29 - 30 triệu đồng\n\n- Phiên bản 256GB: Khoảng 32 - 33 triệu đồng\n\n- Phiên bản 512GB: Khoảng 39 - 40 triệu đồng\n\n- Phiên bản 1TB: Khoảng 44 - 45 triệu đồng.\n\nMua iPhone 13 Pro Max chính hãng VN/A giá rẻ tại CellphoneS\nĐược nâng cấp đáng kể về màn hình hiển thị, camera chụp ảnh lẫn những thay đổi mang tích bước ngoặt, điện thoại iPhone 13 Pro Max được dự đoán sẽ gây bùng nổ làng smartphone trong năm 2021. Để là một trong những người đầu tiên cập nhật và sớm sở hữu trên tay sản phẩm chính hãng Apple, bạn hãy đặt trước tại hệ thống CellphoneS ngay hôm nay!\n\nSắp tới đây, Apple sẽ cho ra mắt thế hệ iPhone 14 Pro Max với nhiều cải tiến về camera và cấu hình. Đây hứa hẹn sẽ lại là siêu phẩm mang đến cho người dùng những trải nghiệm tuyệt vời hơn.",
      "descriptionSort": "<ul>\n<li>Hiệu năng vượt trội - Chip Apple A15 Bionic mạnh mẽ, hỗ trợ mạng 5G tốc độ cao</li><li>Hiệu năng vượt trội - Chip Apple A15 Bionic mạnh mẽ, hỗ trợ mạng 5G tốc độ cao</li><li>Không gian hiển thị sống động - Màn hình 6.7\" Super Retina XDR độ sáng cao, sắc nét</li>\n</ul>",
      "ishidden": true
    },
    {
      "id": 2,
      "name": "Nokia 105 (2017)",
      "price": 2300000,
      "sale": 400000,
      "image": "https://cf.shopee.vn/file/e801468c91d94bc197bd86bfb62f985f",
      "categoryId": 1,
      "outstanding": "Thu cũ đổi mới với giá 3tr",
      "descriptionLong": "On Sale 20% off - Only a few left!If diamonds are a girl's best friend, you'll win hearts, diamonds, and more in this stunning satin and lace robe. Here's betting you'll find this the perfect piece to pack for a romantic getaway or even for lounging around on a night in 100% silk.Made in the USA0 123\nBạn có thể mua Nokia 105 (2017) với mức giá rẻ nhất 240.000 đ tại Shopee đây là mức giá thấp hơn -2% so với Nokia 105 (2017) được bán tại Lazada với giá 235.000 đ, hoặc bạn còn có thể mua tại Sendo và Lazada.\nBên cạnh đó, Nokia 105 (2017) cũng có thể được mua từ Ma-lai-xi-a tại Shopee với mức giá từ 235.564 đ hoặc Phi-líp-pin tại Shopee với mức giá từ 379.611 đ.\nMức giá được cập nhật lần cuối vào July 2022.",
      "descriptionSort": "Điện thoại Nokia 105 (2017) có thiết kế bằng Nhựa với trọng lượng 73g nhỏ gọn. Máy có kích thước màn hình 1.8\" có độ phân giải 120 x 160pixels. Với dung lượng pin lớn 800mAh cùng chế độ chờ 623h cho thời gian đàm thoại lên tới 22h giúp bạn có thể sử dụng máy trong thời gian dài mà không cần sạc.",
      "ishidden": true
    },
    {
      "id": 3,
      "name": "iPad 10.2 2021 WiFi 64GB | Chính hãng Apple Việt Nam",
      "price": 12000000,
      "sale": 2000000,
      "image": "https://cdn2.cellphones.com.vn/358x/media/catalog/product/s/a/samsung-galaxy-tab-s8-002.jpg",
      "categoryId": 2,
      "outstanding": "Hiệu năng ổn định - Apple A13 Bionic 6 nhân mạnh mẽ\nTrải nghiệm hiển thị chất lượng - Màn hình Retina 10.2 inch, hỗ trợ True Tone\n",
      "descriptionLong": "iPad Gen 9 (10.2 inch) 2021 - Hiệu năng đỉnh với mức giá sinh viên\nSau sự thành công của chiếc iPad Gen 8 cùng với iPad Air 4, Apple lại tiếp tục rục rịch cho ra mắt thêm sản phẩm mới. Thiết bị mang tên iPad Gen 9, kế thừa đặc trưng của dòng nhưng được nâng cấp thêm về hiệu năng cũng như camera.\n\nThiết kế mỏng nhẹ, màn hình kích thước 10.5 inches\niPad 10.2 inch 2021 vẫn mang thiết kế đặc trưng bởi sự mỏng và nhẹ, giúp người dùng dễ thao tác, cầm nắm trong hàng giờ liền mà không hề cảm thấy bị mỏi hay khó chịu. Thiết kế nguyên khối đã là nét đặc trưng của dòng sản phẩm iPad giúp mang lại vẻ sang trọng khi sử dụng tên tay.\n\nThiết kế mỏng nhẹ, màn hình kích thước 10.5 inches\n\nMàn hình của iPad 10.2 inch 2021 kích thước lớn cùng khả năng hiển thị sống động. Màn hình True Tone trên iPad 10.2 inch còn hỗ trợ điều chỉnh màn hình theo nhiệt độ màu.\n\nCấu hình mạnh mẽ bởi chip A13 Bionic, bộ nhớ trong dung lượng lớn\niPad Gen 9 được cung cấp sức mạnh bởi con chip A13 Bionic. Đây là con chip được sán xuát trên tiến trình 7nm+, cho phép xử lý hiệu suất cao gấp 6 lần so với thế hệ trước.\n\nCấu hình mạnh mẽ bởi chip A13 Bionic, bộ nhớ trong 32/ 64 GB\n\nChưa hết, củng cố thêm sức mạnh cho chiếc iPad Gen 9 đó là dung lượng RAM lớn, hỗ trợ hoạt động đa nhiệm tốt. Bên cạnh đó, người dùng có thêm sự lựa chọn đến từ bộ nhớ trong 64GB. Ngoài ra, thiết bị còn nhiều phiên bản bộ nhớ khác tùy vào nhu cầu sử dụng của người dùng.\n\nMua iPad 10.2 inch 2021 chính hãng, giá rẻ tại CellphoneS\nNếu bạn đang cần một chiếc tablet để hỗ trợ làm việc hoặc chơi game thì iPad 10.2 inch 2021 chính là chiếc máy tính bảng phù hợp. Sản phẩm đang được kinh doanh chính hãng tại CellphoneS với mức giá ưu đãi cùng bảo hành lâu dài 12 tháng. Ngoài ra, bạn cũng có thể tham khảo thêm thông số cấu hình của iPad Gen 10 sắp ra mắt trong năm 2022.",
      "descriptionSort": "Thiết kế mỏng nhẹ, màn hình kích thước 10.5 inches",
      "ishidden": true
    },
    {
      "id": 4,
      "name": "Samsung Galaxy S22 Ultra (8GB - 128GB)",
      "price": 12000000,
      "sale": 2300000,
      "image": "https://cdn2.cellphones.com.vn/358x/media/catalog/product/s/m/sm-s908_galaxys22ultra_front_phantomblack_211119_1.jpg",
      "categoryId": 1,
      "outstanding": "thu cũ lên đời - trợ cấp giá hơn 1tr",
      "descriptionLong": "Đúng như các thông tin được đồn đoán trước đó, mẫu flagship mới của gả khổng lồ Hàn Quốc được ra mắt với tên gọi là Samsung Galaxy S22 Ultra với nhiều cải tiến đáng giá. Mẫu điện thoại cao cấp đến từ Samsung này có nhiều thay đổi từ thiết kế, cấu hình cho đến camera. Vậy siêu phẩm này có gì mới, giá bao nhiêu và có nên mua không? Hãy cùng tìm hiểu chi tiết ngay bên dưới nhé!\n\nSamsung S22 Ultra được nâng cấp gì so với S21 Ultra\nTrước khi chính thức ra mắt cộng đồng những chiếc điện thoại Samsung S22 Series đã có thời gian được thai nghén khá dài để đảm bảo có những tính năng thực sự vượt trội so với phiên bản tiền nhiệm. Để có thể hình dung rõ ràng ta xét đến 2 mẫu Samsung S22 Ultra và S21 Ulta xem dòng flagship mới nhà Samsung có những nâng cấp nổi trội nào nhé!\n\nGalaxy S22 Ultra\tGalaxy S21 Ultra\nMàu sắc\n\nĐỏ Burgundy\n\nĐen Phantom\n\nXanh Zeta\n\nTrắng Phantom\n\nBạc Phantom\n\nĐen Phantom\n\nKích thước\n\n6.8 inch\n\n6.8 inch\n\nMàn hình\n\nDynamic AMOLED 2X\n\nDynamic AMOLED 2X\n\nĐộ phân giải\n\n2K+ (1440 x 3088 Pixels)\n\n2K+ (1440 x 3200 Pixels)\n\nCPU\n\nSnapdragon 8 Gen 1\n\nExynos 2100 8 nhân\n\nROM - Bộ nhớ trong\n\n128GB/256GB\n\n128GB/256GB/512GB\n\nRAM - Bộ nhớ đệm\n\n12GB\n\n12GB\n\nCamera trước\n\n40MP\n\n40 MP\n\nCamera sau\n\nChính: 108 MP\n\nGóc siêu rộng: 12MP\n\nTele: 10MP\n\nTele: 10MP\n\nZoom quang học: 3x, 10x\n\nChính: 108 MP\n\nGóc siêu rộng: 12MP\n\nTele: 10MP\n\nTele: 10MP\n\nZoom quang học: 10x\n\nDung lượng Pin\n\n5000 mAh\n\n5000 mAh\n\nKhả năng sạc nhanh\n\n45W\n\n25W\n\nĐánh giá Samsung Galaxy S22 Ultra 5G chi tiết\nNhững nâng cấp lớn về hiệu năng, dung lượng pin, và trên hết là camera sau chính là những điểm khiến nó trở thành siêu phẩm trong phân khúc cao cấp. Dưới đây là những thông tin cần biết về dòng điện thoại vừa ra mắt của Samsung. Dưới đây là thông số cấu hình của Samsung S22 Ultra vừa được gã khổng lồ Hàn Quốc giới thiệu.\n\nThiết kế nguyên khối - kính sang trọng với độ bền tối ưu\nSamsung Galaxy S22 Ultra đi theo ngôn ngữ thiết kế nguyên khối - kính cao cấp và sang trọng, vốn đã làm nên sự thành công của model tiền nhiệm. Chiếc máy có thiết kế mặt lưng đơn sắc tối giản nhưng không kém phần tinh tế, và màn hình tràn viền bao phủ gần như trọn mặt trước, tạo nên trải nghiệm quan sát rộng rãi trên một thiết bị di động nhỏ gọn vừa tay cầm.\n\nĐộ bền của máy được đảm bảo tối ưu không chỉ qua lớp vỏ nhôm nguyên khối Amor đánh bóng, mà còn qua kính cường lực Corning Gorilla Glass Victus+ bao phủ hai mặt trước và sau. Khung nhôm và kính hoạt động như bộ giáp bảo vệ điện thoại an toàn. Chiếc máy còn có khả năng chống bụi / nước đạt chuẩn IP68 giúp người dùng luôn an tâm khi dùng máy trong những điều kiện môi trường khác nhau.\n\nSamsung S22 Ultra 5G có thiết kế sang trọng với độ bền tối ưu\n\nỐng kính 108MP mang lại khả năng chụp ảnh không giới hạn\nỐng kính chính trên Samsung S22 Ultra với độ phân giải lên đến 108MP, với những khả năng chụp ảnh đêm, chụp chân dung, chụp góc siêu rộng, và zoom quang học 100x đều hiện diện. Chi tiết ảnh và màu sắc tốt nằm trong khoảng zoom 10x, có thể sử dụng zoom 30x trong điều kiện ánh sáng tốt, còn zoom 100x mang tính chất lưu lại thông tin. Camera chính và camera tele hỗ trợ công nghệ chống rung quang học OIS.\n\nCụm camera sau cho phép người dùng sáng tạo ảnh chụp của mình không giới hạn. Hai ống kính còn lại là ống kính 12MP hỗ trợ chụp góc siêu rộng và ống kính tele 10MP. Người dùng có thể sử dụng S22 chụp ảnh macro với ống kính siêu rộng. Màu sắc và chi tiết ảnh cao hơn các model tầm trung, cho độ phân giải và cảm biến tốt hơn.\n\nCamera 108MP trên S22 Ultra mang lại khả năng chụp ảnh không giới hạn\n\nThiết bị được trang bị khả năng chụp ảnh chân dung ban đêm, trong điều kiện thiếu sáng ấn tượng với bộ xử lý hình ảnh AI kết hợp với camera góc rộng 108MP mang lại bức ảnh ban đêm sáng rõ. Với không gian không quá tối, chỉ với thao tác sử dụng chế độ tự động, AI sẽ tự xử lý cho ra hình ảnh sáng, đầy đủ chi tiết và không bị nhiễu. Trường hợp thiếu sáng, chế độ chụp đêm là sự lựa chọn hoàn hảo.\n\nTốc độ khung hình phát hiện ánh sáng và tự động chuyển sang tốc độ khung hình tối ưu. Samsung Galaxy S22 Ultra sử dụng bộ xử lý 4nm với công nghệ Super Night Solution giảm nhiễu hiệu quả.\n\nĐồng thời, người dùng có thể điều chỉnh được mức độ xóa phông sau khi chụp. Khi thực hiện quay video cần hiệu chỉnh phần hậu cảnh, người dùng có thể làm nổi bật chủ thể bằng cách sử dụng bộ lọc đổi phông thành đen trắng. Phần chuyển nét mượt mà và không có cảm giác bị lẹm.\n\nĐánh giá camera Samsung Galaxy S22 Ultra 5G\n\nKhông chỉ chụp ảnh, thiết bị còn mang lại khả năng quay phim chất lượng với khả năng chống rung và công nghệ AI mang lại những thước phim chuyển động nhanh mà vẫn đảm bảo rõ nét, zoom tốt hơn. Điện thoại còng được trang bị công nghệ Super HDR tốt với tất cả các ống kính mang lại những thước phim giàu chi tiết. Ấn tượng nhất trên camera của Samsung S22 Ultra đó chính là khả năng thu phóng 100 lần đầy ấn tượng.\n\nPhía trước máy là camera selfie đơn với độ phân giải lên đến 40 MP, khẩu độ f/2.2 với khả năng chụp góc rộng cho ra ảnh chụp selfie bắt mắt. Tính năng làm đẹp AI, gọi video call kép và HDR tự động sẽ giúp tăng cường trải nghiệm chụp ảnh trên chiếc flagship này.\n\nĐiểm nổi bật nữa của cụm camera nằm ở thời gian phơi sáng đến 6 giây nhưng bị rung nhòe kể cả không sử dụng chân đế!\n\nĐánh giá camera Samsung Galaxy S22 Ultra 5G - Ảnh 2\n\nMàn hình 6.8 inch 120 Hz tương thích bút S-Pen hiện đại\nVới Galaxy S22 Ultra thì Samsung đã cho ra đời loại màn hình phủ trọn mặt trước đầy ấn tượng. Chiếc màn hình điện thoại có kích thước 6.8 inch, độ phân giải Quad HD+ (3200 x 1440 pixels) và sử dụng tấm nền Dynamic AMOLED 2X với Vision Booster cho ra độ bão hòa màu sắc đầy chân thực.\n\nMàn hình của Samsung S22 Ultra còn được tích hợp những tính năng cao cấp đặc trưng của Samsung như Always on display, tốc độ làm tươi đến 120 Hz cho trải nghiệm gaming vượt trội và chứng nhận màu HDR10+. Bề mặt màn hình được bảo vệ bởi kính Gorilla Glass Victus chống xước hiệu quả.\n\nSamsung S22 Ultra có màn hình 6.8 inch 120 Hz tương thích bút S-Pen hiện đại\n\nVi xử lý Snapdragon 8 Gen 1 cùng pin lớn giúp giải trí hiệu quả\nVới Samsung S22 Ultra 5G, nhà sản xuất đã chế tạo nên bộ vi xử lý thế hệ mới mang tên Qualcomm Snapdragon 8 Gen 1. Hiệu năng trên Qualcomm Snapdragon 8 Gen 1 được cải tiến rất nhiều so với thế hệ trước nhằm mang lại hiệu năng mượt mà đáp ứng cả những tựa game nặng nhất, đồng thời chứa khả năng tiết kiệm năng lượng pin giúp người dùng yên tâm dùng máy dài lâu.\n\nCon chip Qualcomm Snapdragon 8 Gen 1 được sản xuất trên tiến trình 4nm không chỉ mang lại một hiệu năng mạnh mẽ mà còn sở hữu sức mạnh AI mang lại trải nghiệm chụp đêm vượt trội.\n\nNói về pin, điện thoại được trang bị viên pin dung lượng 5000mAh sẽ cung cấp cho người dùng tới 81 giờ chơi nhạc. Công nghệ sạc nhanh siêu tốc 45W, cùng sạc không dây chuẩn Qi và sạc ngược sẽ giúp Galaxy S22 Ultra trở thành chiếc smartphone đa chức năng nổi bật trong phân khúc. Pin hỗ trợ tiết kiệm năng lượng, cho thời lượng sử dụng trong thời gian dài.\n\nĐánh giá hiệu năng Galaxy S22 Ultra với Snapdragon 8 Gen 1\n\nĐánh giá hiệu năng Samsung S22 Ultra với Snapdragon 8 Gen 1\n\nSau nhiều năm chạy chip Exynos thì S22 Ultra là mẫu điện thoại Samsung chính hãng hiếm hoi tại Việt Nam chạy Snapdragon 8 Gen 1. Trước khi đánh giá hiệu năng, cùng điểm lại một số thông số cấu hình nhé:\n\n- Vi xử lý: Snapdragon 8 Gen 1\n\n- Bộ nhớ RAM: 8GB hoặc 12GB.\n\n- Bộ nhớ trong: 128GB hoặc 256GB hoặc 512GB.\n\nSau đây là điểm số benchmark được các trang chuyên công nghệ thực hiện.\n\nĐiểm Geekbench 5 của S22 Ultra PCMag thực hiện:\n\n- Điểm đa nhân: 3.433 điểm \n\n- Điểm đơn nhân: 1.232\n\nĐiểm số này có sự khác biệt so với chip Snapdragon 888 được ra mắt nắm 2020. Cụ thể, điểm đơn lõi tăng 13% và đa lõi tăng 9%. Nhưng trên thang điểm chuẩn của GFXBench thì ở một số tác vụ nhất định, con chip này cho hiệu năng tốt hơn khoảng 20%.\n\n Đánh giá hiệu năng Galaxy S22 Ultra với Snapdragon 8 Gen 1 - Ảnh 2\n\nHỗ trợ bút S Pen tiện lợi\nTương tự như model tiền nhiệm, điện thoại thông minh Samsung Galaxy S22 Ultra cũng hoàn toàn tương thích với bút cảm ứng S-Pen qua điều khiển không day Air Actions - vốn là điểm đặc trưng của dòng Galaxy Note trước đây. Người dùng có thể dùng S-Pen cho những tác vụ thiết kế, ghi chú nhanh, và điều khiển từ xa với tính hiệu quả vượt trội.\n\nĐộ chính xác bút S-Pen cao, giúp các ghi chú và tin nhắn của bạn trở nên sinh động, thú vị. Chữ viết tay thành văn bản nhanh chóng hoặc thêm hình ảnh động vào, nâng cao tính chuyên nghiệp và sáng tạo.\n\nSamsung đã trang bị khe cắm S Pen trên thiết bị giúp người dùng có thể tiện lợi khi sử dụng. Tuy nhiên khác với trước đó là S Pen sẽ có cùng màu với máy thì năm nay, S-Pen sẽ chỉ có màu đen. \n\nVới bút S Pen, giời đây người dùng Galaxy S22 Ultra có thể thoải mái ghi chú, điều khiển điện thoại như trên các dòng Samsung Note. Bút Spen mới này cũng được cải thiện độ trễ mang lại trải nghiệm dùng chân thực từ viết chữ, vẽ hay ghi chú. \n\nSamsung Galaxy S22 Ultra hỗ trợ bút S Pen tiện lợi\n\nKết nối dễ dàng với hệ sinh thái Galaxy\nỞ phiên bản điện thoại Samsung S22 Ultra mới, người dùng có thể kết nối với các thiết bị khác một cách dễ dàng thông qua hệ sinh thái Galaxy như Galaxy S22+, Galaxy Tab S8 Ultra, Galaxy Buds Pro, Galaxy Watch 4,…. Nhờ đó, người dùng có thể truy cập vào các ứng dụng trên điện thoại thông qua máy tính Samsung một cách dễ dàng.\n\nS22 Ultra kết nối dễ dàng với hệ sinh thái Galaxy\n\nBạn có thể kết nối với Galaxy Tab S8 Ultra, Samsung Notes được đồng bộ hóa cho phép chỉnh sửa. Ngoài ra, việc di chuyển từ màn hình S22 Ultra sang màn hình thiết bị khác thông qua ghép nối giúp người dùng có trải nghiệm màn hình kép.\n\nThêm vào đó là tính năng Smart Switch cho phpeps chuyển đổi dữ liệu qua thiết bị mới nhanh chóng kể cả các thiết bi cũ khác hệ điều hành.\n\nKết nối trực tuyến, bảo mật thông tin cá nhân\nNgười dùng có thể kết nối với nhau trực tuyến thông qua Google Duo, chia sẻ màn hình để xem video cùng nhau giống IRL. Bên cạnh đó, khi khởi động Samsung Knox, dữ liệu cá nhân của bạn sẽ được bảo mật an toàn.\n\nKnox Vault bảo vệ thông tin sinh trắc học, trong khi Thư mục bảo mật khóa dữ liệu riêng tư quan trọng. Trang tổng quan Sử dụng quyền mới cho phép xem ứng dụng đang chia sẻ dữ liệu hoặc đang theo dõi người dùng. Bạn cũng có thể cấp hoặc từ chối quyền truy cập theo điều khoản.\n\nS22 Ultra hỗ trợ kết nối trực tuyến, bảo mật thông tin cá nhân\n\nĐiện thoại Samsung S22 Ultra giá bao nhiêu?\nTheo dự kiến, giá bán của dòng Galaxy S22 series năm nay có thể tương đương hoặc cao hơn đôi chút so với thế hệ Galaxy S21 series trước đó. Mức giá của 3 phiên bản S22 thường, S22 Plus và S22 Ultra dự kiến như sau:\n\nSản phẩm\n\nRAM/Bộ nhớ\n\nGiá niêm yết\n\nSamsung Galaxy S22\n\n8GB/128GB\n\n21,990,000đ\n\n8GB/256GB\n\n23,490,000đ\n\nSamsung Galaxy S22 Plus\n\n8GB/128GB\n\n25,990,000đ\n\n8GB/256GB\n\n27,490,000đ\n\nSamsung Galaxy S22 Ultra\n\n8GB/128GB\n\n31,990,000đ\n\n12GB/256GB\n\n33,990,000đ\n\n12GB/512GB\n\n36,990,000đ\n\nGiá bán sẽ thay đổi tùy vào dung lượng RAM và bộ nhớ trong của điện thoại.\n\nSamsung Galaxy S22 Ultra 5G có mấy màu?\nNếu phiên bản Galaxy S22 và S22 Plus được trang bị bốn màu là trắng, xanh, hồng và đen thì trên phiên bản cao cấp nhất S22 Ultra sẽ có bốn màu sắc lần lượt là:\n\n- Đỏ burgundy\n\n- Xanh Zeta\n\n- Trắng phantom\n\n- Đen phantom\n\nVề thiết kế mặt trước, máy được trang bị viền màn hình siêu mỏng cùng thiết kế đục lỗ chứa camera trước. Màn hình Galaxy S22 Ultra sẽ được trang bị kính cường lực Gorilla Glass Victus+ bền bỉ cùng với đó là độ sáng cao mang lại khả năng hiển thị rõ nét.\n\nĐiện thoại Samsung S22 Ultra có mấy màu?\n\nGalaxy S22 Ultra có bao nhiêu phiên bản bộ nhớ?\nTrước nhiều đồn đoán rằng  Samsung S22 Ultra có thể cho ra mắt phiên bản bộ nhớ 1TB thì thực tế hãng chỉ cho ra mắt ba phiên bản cấu hình bộ nhớ, trong đó phiên bản bộ nhớ cao nhất là 512GB.\n\n- Phiên bản 128GB: Đây là phiên bản cấu hình tiêu chuẩn, phù hợp với nhu cầu sử dụng của nhiều người dùng.\n\n- Phiên bản 256GB: Nếu người dùng có như cầu lưu trữ hình ảnh, video lớn thì bộ nhớ 256GB là lựa chọn đáng để tham khảo.\n\n- Phiên bản 512GB: Với phiên bản 512GB bộ nhớ sẽ phù hợp với những người dùng đòi hỏi không gian lưu trữ lớn như quay phim, chụp ảnh 8K hay lưu trữ dữ liệu lớn.\n\nNgoài ba phiên bản bộ nhớ lưu trữ thì Samsung cũng cung cấp tới haio phiên bản bộ nhớ RAM lần lượt là 8GB và 12GB cho người dùng lựa chọn.\n\nCó gì bên trong hộp Samsung S22 Ultra 5G?\nBên trong hộp sản phẩm có gì? Cũng như nhiều phiên bản trước, hộp đựng Galaxy S22 sở hữu một thiết kế theo phong cách tối giản với tone màu chủ đạo là đen. Ngay sau nắp hộp là chiếc siêu phẩm được nhiều người dùng mong chờ.\n\nPhía dưới nữa là các phụ kiện quen thuộc không thể thiếu như cáp sạc, sách hướng dẫn sử dụng, que chọc sim. Toàn bộ các phụ kiện này được bọc kỹ trong một lớp giấy cứng. Samsung S22 Ultra sẽ không có củ sạc, tương tự nhiều flagship hiện nay.\n\nCó gì bên trong hộp Samsung galaxy S22 Ultra?\n\nĐiện thoại Samsung Galaxy S22 Ultra ra mắt khi nào?\nVề thời gian ra mắt, cũng như mọi năm, dòng Galaxy S thông thường sẽ được ra mắt vào quý 1. Và không có gì thay đổi, vừa qua Samsung đã trình làng chiếc Galaxy S22 Ultra vào ngày 9 tháng 2 năm 2022 tại sự kiện Galaxy Unpacked.\n\nTại sự kiện này, bên cạnh S22 Ultra thì Samsung còn giới thiệu đến người dùng nhiều sản phẩm khác như Samsung S22 tiêu chuẩn và S22 Plus.\n\nĐiện thoại Samsung S22 Ultra ra mắt khi nào?\n\nMua Samsung S22 Ultra 5G chính hãng giá rẻ tại CellphoneS\nCó thể nói rằng Samsung Galaxy S22 Ultra đang là một trong những chiếc smartphone tốt nhất hiện nay và đang làm mưa làm gió trên thị trường. Nếu quan tâm đến siêu phẩm này, khách hàng có thể tham khảo tại hệ thống hơn 80 cửa hàng hoặc website của CellphoneS. Bạn sẽ nhận được mức giá cực kỳ ưu đãi và còn có cơ hội nhận thêm những phần quà hấp dẫn cùng chế độ bảo hành chính hãng uy tín khi mua sản phẩm tại tây. Thông tin chi tiết bạn hãy liên hệ hotline 1800.2097 để được tư vấn.",
      "descriptionSort": "Vi xử lý mạnh mẽ nhất Galaxy - Snapdragon 8 Gen 1 (4 nm)\nCamera mắt thần bóng đêm Nightography - Chụp đêm cực đỉnh\nS Pen đầu tiên trên Galaxy S - Độ trễ thấp, dễ thao tác\nDung lượng pin bất chấp ngày đêm - Viên pin 5000mAh, sạc nhanh 45W",
      "ishidden": true
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "phone"
    },
    {
      "id": 2,
      "name": "tablet"
    }
  ]
}
